
export const InviteSuccessMessage = () => (
    <div>
        <div>
            Ви успішно авторизувалися!
        </div>
        <br/>
        <div>
            <p>
                Це запрошення було використано для авторизації і втратило свою актуальність. Воно буде видалене протягом
                30 днів.
            </p>
            <p>
                Якщо ви не використовували це запрошення для отримання доступу на цьому сайті, звяжіться з людиною яка
                надіслала вам запрошення і попросіть нове посилання.
            </p>
        </div>
    </div>
);